# ===== 問題データ（ここを自由に編集） =====
quiz_list = [
    {
        "question": "自動火災報知設備において、階段の警戒区域の扱いとして正しいものはどれか。",
        "choices": {
            "a": "各階ごとに警戒区域とする",
            "b": "居室と同一警戒区域に含める",
            "c": "縦に連続する1警戒区域として扱う",
            "d": "警戒区域に含めない"
        },
        "answer": "c",
        "explanation": "階段は縦に連続した空間であるため、原則として1つの警戒区域として扱う。"
    },
    {
        "question": "P型2級受信機で扱える警戒区域数として適切なものはどれか。",
        "choices": {
            "a": "3区域",
            "b": "5区域",
            "c": "8区域",
            "d": "10区域"
        },
        "answer": "b",
        "explanation": "P型2級受信機は最大5回線（5警戒区域）まで対応可能である。"
    },
        {
        "question": "次のうち特定防火対象物でないものはどれか",
        "choices": {
            "a": "病院",
            "b": "老人福祉施設",
            "c": "飲食店",
            "d": "小学校"
        },
        "answer": "d",
        "explanation": "小学校は特定防火対象物に該当しない"
    },
    {
    "question": "特定防火対象物に該当するものはどれか",
    "choices": {
        "a": "小学校",
        "b": "共同住宅",
        "c": "百貨店",
        "d": "図書館"
    },
    "answer": "c",
    "explanation": "百貨店は特定防火対象物に該当する"
    },
    {
    "question": "消防用設備等を設置する場合の防火対象物の基準について、正しいのはどれか",
    "choices": {
        "a": "防火対象物が開口部のない耐火構造の床又は壁で区画されているときは、それぞれ別の防火対象物とみなされる",
        "b": "同一敷地内にある２以上の防火対象物は、原則として一の防火対象物としてみなされる",
        "c": "設置することが義務付けられている防火対象物は、百貨店、病院、旅館等不特定多数の者が出入りする防火対象物に限られる",
        "d": "戸建て一般住宅についても一定の規模を超える場合、消防用設備等の設置を義務付けられる場合がある"
    },
    "answer": "a",
    "explanation": "防火対象物が開口部のない耐火構造の床又は壁で区画されているときは、それぞれ別の防火対象物とみなされる"
    },
    {
    "question": "消防用設備等の技術上の基準に関する政令が改正されたとき、改正後の規定に適合させなければならない消防用設備等は次のうちどれか",
    "choices": {
        "a": "工場に設置されている屋内消火栓設備",
        "b": "展示場に設置されている自動火災報知設備",
        "c": "ラック式倉庫に設置されているスプリンクラー設備",
        "d": "図書館の蔵書室に設置されている窒素を放射する不活性ガス消火設備"
    },
    "answer": "b",
    "explanation": "展示場は特定防火対象物であり、改正後の規定に適合させなければならない"
    },

]





